Ball = require('./Ball');


# ---------------------------------------------------
# 球体View
# ---------------------------------------------------
class BallsView
  
  
  # -----------------------------------------------
  # コンストラクタ
  # -----------------------------------------------
  constructor: (scene) ->
    
    @_scene = scene;
    
    @_ball = [];
  
  
  
  # -----------------------------------------------
  # 初期化
  # -----------------------------------------------
  init: =>
    
    # 球体作成
    num = MY.conf.COLOR.length * 30;
    i = 0;
    while i < num
      ball = new Ball(i);
      ball.init();
      @_scene.add(ball.mesh);
      @_ball.push(ball);
      i++;
    
    MY.update.add(@_update);
  
  
  
  # -----------------------------------------------
  # 更新
  # -----------------------------------------------
  _update: =>
    
    for val,i in @_ball
      val.update();








module.exports = BallsView;